Стремление к профессиональному совершенству

Адекватная самооценка
Самостоятельность
Пунктуальность, педантичность
Дисциплинированность
Аккуратность в работе
Организованность, самодисциплина
Старательность, исполнительность
Ответственность
Трудолюбие
Инициативность
Самокритичность
Оптимизм, доминирование положительных эмоций
Самообладание, эмоциональная уравновешенность, выдержка
Самоконтроль, способность к самонаблюдению
Предусмотрительность
Фрустрационная толерантность (отсутствие агрессивности или          депрессивности в ситуациях неудач)
Самомобилизующийся тип реакции на препятствия, возникающие на пути к достижению цели.
Интернальность (погруженность в себя, самодостаточность, необщительность)
Экстернальность (ориентация на взаимодействие с людьми, общительность)
Интрапунитивность (ориентация на собственные силы, уверенность в себе, чувство самоэффективности)
Экстрапунитивность (ориентация на помощь других людей, надежда на благоприятные обстоятельства, неуверенность в себе)
Способность планировать свою деятельность во времени
Способность организовывать свою деятельность в условиях большого потока информации и разнообразия поставленных задач
Способность брать на себя ответственность за принимаемые решения и действия
Способность принимать решение в нестандартных ситуациях
Способность рационально действовать в экстремальных ситуациях
Способность эффективно действовать (также быстро принимать решения) в условиях дефицита времени
Способность переносить неприятные ощущения (дурной запах, шум, грязь, холодная вода, ожог, царапина, удар электрического тока и т.д.) без потрясений
Способность аргументировано отстаивать свое мнение
Способность к переключениям с одной деятельности на другую
Способность преодолевать страх


Решительность
Сильная воля
Смелость


Чувство долга
Честность
Порядочность
Товарищество.


Зрительная оценка размеров предметов.
Зрительное восприятие расстояний между предметами.
Глазомер: линейный, угловой, объемный.
Глазомер динамический (способность оценивать направление и скорость движения предмета).
Способность к различению фигуры (предмета, отметки, сигнала и пр.) на малоконтрастном фоне.
Способность различать и опознавать замаскированные объекты.
Способность к восприятию пространственного соотношения предметов.
Точность и оценка направления на источник звука.
Способность узнавать и различать ритмы
Речевой слух (восприятие устной речи)
Различение отрезков времени
Способность к распознаванию небольших отклонений параметров технологических процессов от заданных значений по визуальным признакам
Способность к распознаванию небольших отклонений параметров технологических процессов от заданных значений по акустическим признакам
Способность к распознаванию небольших отклонений параметров технологических процессов от заданных значений по кинестетическим признакам


Способность к зрительным представлениям.
Способность к пространственному воображению.

Способность к образному представлению предметов, процессов и явлений.
Способность наглядно представлять себе новое явление, ранее, не встречающееся в опыте, или старое, но в новых условиях
Способность к переводу образа в словесное описание
Способность к воссозданию образа по словесному описанию


Аналитичность (способность выделять отдельные элементы действительности, способность к классификации)
Синтетичность (способность к обобщениям, установлению связей, закономерностей, формирование понятий)
Транссонантность (способность к актуализации и вовлечению в процесс мышления информации, хранящейся в памяти, ассоциативность мышления)
Логичность
Креативность (способность порождать необычные идеи, отклоняться от традиционных схем мышления)
Оперативность (скорость мыслительных процессов, интеллектуальная лабильность)
Объектные свойства мышления (информационный материал, используемый в процессе мышления)
Предметность (объекты реального мира и их признаки)
Образность (наглядные образы, схемы, планы и т.д.)
Абстрактность (абстрактные образы, понятия)
Вербальность (устная и письменная речь)
Калькулятивность (цифровой материал)